[
  {
    "id": 1,
    "category": "Перед вакцинацией",
    "title": "Консультация с врачом",
    "description": "Перед вакцинацией необходимо проконсультироваться с врачом, особенно если у вас есть хронические заболевания или аллергии.",
    "details": [
      "Сообщите врачу о любых имеющихся у вас хронических заболеваниях",
      "Расскажите о предыдущих реакциях на вакцины",
      "Обсудите возможные противопоказания",
      "Уточните, нужны ли дополнительные анализы перед вакцинацией"
    ],
    "timing": {
      "when": "За 1-2 недели до вакцинации",
      "duration": "30-60 минут"
    },
    "priority": "high",
    "keywords": ["хронические заболевания", "аллергия", "противопоказания"]
  },
  {
    "id": 2,
    "category": "Перед вакцинацией",
    "title": "Сбор анамнеза",
    "description": "Подготовьте информацию о своих заболеваниях, аллергических реакциях и предыдущих вакцинациях.",
    "details": [
      "Предоставьте информацию о ранее сделанных прививках и реакциях на них",
      "Сообщите о наличии аллергии на компоненты вакцин (яичный белок, антибиотики и др.)",
      "Расскажите о перенесенных недавно инфекционных заболеваниях",
      "Сообщите о приеме лекарственных препаратов"
    ]
  },
  {
    "id": 3,
    "category": "Перед вакцинацией",
    "title": "Проверка здоровья",
    "description": "Непосредственно перед вакцинацией необходимо убедиться, что вы здоровы.",
    "details": [
      "Измерение температуры тела (должна быть нормальной)",
      "Общий осмотр врачом",
      "Оценка общего самочувствия",
      "При необходимости – дополнительные обследования"
    ],
    "warning": "Вакцинацию следует отложить при наличии острых инфекционных заболеваний или обострении хронических заболеваний."
  },
  {
    "id": 4,
    "category": "Перед вакцинацией",
    "title": "Питание",
    "description": "Не рекомендуется голодать перед вакцинацией, но и переедать тоже не стоит.",
    "details": [
      "Примите пищу за 1-2 часа до прививки",
      "Предпочтительна легкая, привычная еда",
      "Избегайте новых продуктов, которые могут вызвать аллергию",
      "Обеспечьте достаточное питье"
    ]
  },
  {
    "id": 5,
    "category": "В день вакцинации",
    "title": "Поведение в пункте вакцинации",
    "description": "В пункте вакцинации необходимо следовать определенным правилам.",
    "details": [
      "Придите на вакцинацию в назначенное время",
      "Возьмите с собой документы (паспорт, медицинский полис)",
      "Наденьте одежду, обеспечивающую легкий доступ к месту инъекции",
      "После вакцинации оставайтесь в пункте вакцинации 15-30 минут для наблюдения"
    ],
    "warning": "Немедленно сообщите медицинскому персоналу, если почувствуете себя плохо после прививки."
  },
  {
    "id": 6,
    "category": "В день вакцинации",
    "title": "Психологическая подготовка",
    "description": "Особенно важно для детей и людей с боязнью инъекций.",
    "details": [
      "Избегайте негативных высказываний о вакцинации при детях",
      "Объясните ребенку важность и процедуру вакцинации в доступной форме",
      "Не обманывайте ребенка, говоря что будет не больно, если это не так",
      "Возьмите с собой любимую игрушку для маленького ребенка"
    ]
  },
  {
    "id": 7,
    "category": "После вакцинации",
    "title": "Наблюдение за состоянием",
    "description": "В течение первых суток после вакцинации необходимо внимательно следить за самочувствием.",
    "details": [
      "Периодически измеряйте температуру тела",
      "Следите за местом инъекции (небольшое покраснение и уплотнение допустимы)",
      "Оцените общее самочувствие",
      "При тревожных симптомах обратитесь к врачу"
    ],
    "warning": "Немедленно обратитесь за медицинской помощью при сильном повышении температуры, сильной боли, отеке или покраснении в месте инъекции, сыпи, затрудненном дыхании или других необычных симптомах."
  },
  {
    "id": 8,
    "category": "После вакцинации",
    "title": "Физическая активность",
    "description": "Следует временно ограничить физические нагрузки после вакцинации.",
    "details": [
      "Избегайте интенсивных физических нагрузок в день вакцинации",
      "Не рекомендуется посещать сауну или баню в течение 1-2 дней",
      "Не стоит плавать в открытых водоемах или бассейнах в день вакцинации",
      "Легкая физическая активность допустима, если вы хорошо себя чувствуете"
    ]
  },
  {
    "id": 9,
    "category": "После вакцинации",
    "title": "Питьевой режим",
    "description": "После вакцинации важно обеспечить достаточное количество жидкости.",
    "details": [
      "Пейте больше воды в день вакцинации и на следующий день",
      "Подходят также некрепкий чай, компоты, морсы",
      "Избегайте алкогольных напитков в течение минимум 3 дней после вакцинации",
      "Избегайте газированных и сильно охлажденных напитков"
    ]
  },
  {
    "id": 10,
    "category": "После вакцинации",
    "title": "Борьба с побочными эффектами",
    "description": "При появлении допустимых побочных эффектов можно принять меры для их облегчения.",
    "details": [
      "При повышении температуры можно принять жаропонижающее (парацетамол или ибупрофен)",
      "При болезненности в месте инъекции можно приложить чистый прохладный компресс",
      "При общем недомогании обеспечьте отдых и покой",
      "Проконсультируйтесь с врачом, прежде чем принимать какие-либо лекарства"
    ],
    "warning": "Не принимайте антигистаминные препараты (от аллергии) превентивно, до появления симптомов аллергии, так как это может маскировать истинную реакцию организма на вакцину."
  },
  {
    "id": 11,
    "category": "Особые рекомендации",
    "title": "Вакцинация при беременности",
    "description": "Беременным женщинам следует соблюдать особые правила вакцинации.",
    "details": [
      "Некоторые вакцины противопоказаны при беременности (особенно живые вакцины)",
      "Вакцинация против гриппа и COVID-19 рекомендована беременным женщинам",
      "Решение о вакцинации должно приниматься индивидуально после консультации с врачом",
      "Лучшее время для плановой вакцинации – до наступления беременности"
    ]
  },
  {
    "id": 12,
    "category": "Особые рекомендации",
    "title": "Вакцинация при кормлении грудью",
    "description": "Кормящим матерям обычно можно проводить вакцинацию без прерывания грудного вскармливания.",
    "details": [
      "Большинство вакцин безопасно при грудном вскармливании",
      "Нет необходимости прерывать грудное вскармливание после вакцинации",
      "Антитела, образующиеся после вакцинации матери, могут передаваться ребенку с грудным молоком, что является дополнительной защитой",
      "Необходима консультация с врачом перед вакцинацией"
    ]
  },
  {
    "id": 13,
    "category": "Особые рекомендации",
    "title": "Вакцинация детей",
    "description": "Вакцинация детей имеет свои особенности и требует специальной подготовки.",
    "details": [
      "Ознакомьтесь с календарем профилактических прививок для детей",
      "Подготовьте ребенка психологически, объяснив процедуру в доступной форме",
      "Не пугайте ребенка и не обманывайте его насчет болезненности процедуры",
      "После вакцинации внимательно следите за состоянием ребенка и при необходимости консультируйтесь с педиатром"
    ],
    "warning": "Особенно внимательно следите за состоянием младенцев и детей раннего возраста после вакцинации, так как они не могут словами описать свое самочувствие."
  },
  {
    "id": 14,
    "category": "Особые рекомендации",
    "title": "Вакцинация пожилых людей",
    "description": "Пожилым людям особенно важно соблюдать рекомендации по вакцинации.",
    "details": [
      "Пожилым людям настоятельно рекомендуется вакцинация против гриппа, пневмококковой инфекции, опоясывающего лишая, COVID-19",
      "Необходимо информировать врача о всех принимаемых лекарствах",
      "После вакцинации может потребоваться более длительный период наблюдения",
      "Рекомендуется сопровождение родственника или близкого человека"
    ]
  },
  {
    "id": 15,
    "category": "Особые рекомендации",
    "title": "Вакцинация при иммунодефиците",
    "description": "Людям с иммунодефицитами требуется особый подход к вакцинации.",
    "details": [
      "Живые вакцины обычно противопоказаны при иммунодефицитах",
      "Эффективность вакцинации может быть снижена",
      "Может потребоваться введение дополнительных доз вакцины",
      "Необходима консультация иммунолога или специалиста по инфекционным заболеваниям"
    ],
    "warning": "Людям, принимающим иммуносупрессивные препараты, следует проконсультироваться с врачом о временном изменении режима приема лекарств перед вакцинацией."
  }
] 